w809291634/esp-idf-v5.4.1/examples/_my_examples/SmartCar_wifi_gamepad/main/src/cam_strem/take_picture.c
/*
 * SPDX-FileCopyrightText: 2022-2023 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <stdio.h>
#include <string.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/queue.h"

#include "esp_event.h"
#include "nvs_flash.h"
#include "esp_log.h"

#include "camera_pin.h"
#include "esp_camera.h"
#include "esp32_cam.h"

#include "esp_lcd_panel_io.h"
#include "esp_lcd_panel_vendor.h"
#include "esp_lcd_panel_ops.h"
#include "driver/gpio.h"
#include "driver/spi_master.h"
#include "lvgl.h"
#include "lvgl_app.h"

#if CONFIG_EXAMPLE_LCD_CONTROLLER_ILI9341
#include "esp_lcd_ili9341.h"
#elif CONFIG_EXAMPLE_LCD_CONTROLLER_GC9A01
#include "esp_lcd_gc9a01.h"
#elif CONFIG_EXAMPLE_LCD_CONTROLLER_ST7789
#include "esp_lcd_panel_st7789.h"
#endif

#if CONFIG_EXAMPLE_LCD_TOUCH_CONTROLLER_STMPE610
#include "esp_lcd_touch_stmpe610.h"
#endif

#define DBG_TAG           "take_picture"
//#define DBG_LVL           DBG_INFO
#define DBG_LVL           DBG_LOG
//#define DBG_LVL           DBG_NODBG
#include <mydbg.h>          // must after of DBG_LVL, DBG_TAG or other options

#define TEST_ESP_OK(ret) assert(ret == ESP_OK)
#define TEST_ASSERT_NOT_NULL(ret) assert(ret != NULL)

static bool auto_jpeg_support = false; // whether the camera sensor support compression or JPEG encode
static QueueHandle_t xQueueIFrame = NULL;

static const char *TAG = "video s_client";

extern uint8_t DRAM_ATTR lvgl_draw_buf1[DRAW_BUFFER_SIZE] __attribute__((aligned(16)));
extern uint8_t DRAM_ATTR lvgl_draw_buf2[DRAW_BUFFER_SIZE] __attribute__((aligned(16)));

static void esp_cam_stream_task(void *arg)
{
    camera_fb_t *frame;
    uint8_t *out_buf;
    uint32_t out_length;
    extern esp_lcd_panel_handle_t panel_handle;

    // 用于计算帧率
    static uint32_t frame_count = 0;
    static uint32_t start_time = 0;
    uint32_t current_time;
    
    ESP_LOGI(TAG, "Begin capture frame");

    // 初始化计时器
    start_time = pdTICKS_TO_MS(xTaskGetTickCount());
    while (true) {
        // frame = esp_camera_fb_get();
        frame = NULL;
        if (frame) {
            /* 获取lvgl的显示buffer */
            start_time = pdTICKS_TO_MS(xTaskGetTickCount());
            if(img_jpeg_decode(3, 0,frame->buf,frame->len,&out_buf,&out_length)==0){
                // 测试解析 一帧 240*240 的时间约为 43 ms, 约为23帧
                ESP_LOGI(TAG, "decode use time:%ld", pdTICKS_TO_MS(xTaskGetTickCount()) - start_time);
                ESP_LOGI(TAG, "out_buf:%p out_length:%ld",out_buf,out_length);

                // because SPI LCD is big-endian, we need to swap the RGB bytes order
                lv_draw_sw_rgb565_swap(out_buf, out_length/2);      // 像素数量
                static uint8_t buf_switch = 0;
                for (int y = 0; y < 240; y += EXAMPLE_LVGL_DRAW_BUF_LINES) {
                    ESP_LOGI(TAG, "out_buf:%p", out_buf+(size_t)(EXAMPLE_LCD_H_RES * y * sizeof(lv_color16_t)));
                    if(buf_switch%2 == 0)
                        memcpy(lvgl_draw_buf1,out_buf+(size_t)(EXAMPLE_LCD_H_RES * y * sizeof(lv_color16_t)),DRAW_BUFFER_SIZE);
                    else
                        memcpy(lvgl_draw_buf2,out_buf+(size_t)(EXAMPLE_LCD_H_RES * y * sizeof(lv_color16_t)),DRAW_BUFFER_SIZE);
                    start_time = pdTICKS_TO_MS(xTaskGetTickCount());
                    // copy a buffer's content to a specific area of the display
                    // 80mhz的话，用时极其短。
                    // x宽度240，高度也是显示240行，需要分段 拷贝到 buf1 ，最后显示到一帧里面
                    if(buf_switch%2 == 0)
                        esp_lcd_panel_draw_bitmap(panel_handle,0,y,240,y+EXAMPLE_LVGL_DRAW_BUF_LINES, lvgl_draw_buf1);  // 末行和末列会减1
                    else
                        esp_lcd_panel_draw_bitmap(panel_handle,0,y,240,y+EXAMPLE_LVGL_DRAW_BUF_LINES, lvgl_draw_buf2);  // 末行和末列会减1
                    ESP_LOGI(TAG, "draw use time:%ld y:%d", pdTICKS_TO_MS(xTaskGetTickCount()) - start_time,y);
                    buf_switch ++ ;
                }
                heap_caps_free(out_buf);
            }
            // esp_camera_fb_return(frame);

            // 帧计数增加
            frame_count++;
            // 获取当前时间（单位：ms）
            current_time = pdTICKS_TO_MS(xTaskGetTickCount());
            // 每过一秒打印一次帧率
            if ((current_time - start_time) >= 1000) {
                float fps = (float)frame_count / ((current_time - start_time) / 1000.0f);
                ESP_LOGI(TAG, "FPS: %.2f frame: %zu bytes", fps, frame->len);
                // 重置计数器
                frame_count = 0;
                start_time = current_time;
            }
        }
    }
    vTaskDelete(NULL);
}

void esp_cam_client_stream_init(void)
{
    app_wifi_main();

    xQueueIFrame = xQueueCreate(2, sizeof(camera_fb_t *));

    TEST_ESP_OK(start_stream_client());

    // 创建任务并绑定到 CPU1
    BaseType_t task_created = xTaskCreatePinnedToCore(&esp_cam_stream_task, "cam_stream", 6144, NULL, 5, NULL, 1);
    // 使用 ESP_ERROR_CHECK 检查是否成功创建任务
    ESP_ERROR_CHECK(task_created == pdPASS ? ESP_OK : ESP_FAIL);
}